{"pageProps":{"employees":[{"slug":"aftab-ahmad","frontmatter":{"id":5,"title":"Software Engineer","name":"Aftab Ahmad","image":"/images/employees/Aftab Ahmad.jpeg","imageB":"/images/employees/Aftab-Ahmad-GreenB.svg","category":["Web App Development","Scraping"],"description":"Meet Aftab, our coding captain with a passion for outdoor sports. Dreaming of captaining a cricket team, he brings the same team spirit to pair programming, finding joy in fixing bugs collaboratively with fellow developers. Beyond the screen, catch him strategizing on the cricket pitch or cheering for his favorite team. Aftab brings a dynamic and collaborative spirit to the tech arena, both in code and on the field.","moreInfoOne":"In the domain of ERP, Aftab played a crucial role as a full-stack developer. His tasks ranged from developing and integrating REST APIs, crafting and executing database queries, to implementing business logic for new features. Aftab also took charge of integrating Slack API for automated leave and attendance management, and scripted automatic Slack messages for each employee at specific intervals. His expertise extended to creating responsive web pages using React and seamlessly integrating backend APIs, utilizing technologies like Python, Django, DRF, Postgresql, React, Docker, and GitHub.","moreInfoTwo":"For a Product that ranks entities over the internet, Aftab's role as a full-stack developer involved creating responsive web pages, utilizing React JS chart libraries for custom graphs, enhancing business logic, and eliminating database redundancy. His contributions extended to implementing new features on both the front-end and back-end and transforming the project into a PWA for an enhanced user experience and SEO. The technologies leveraged for this endeavor included Python, Django, DRF, Postgresql, React, Docker, and GitHub.","developmentStack":[{"name":"Python","icon":"/icons/TechStack/python.svg"},{"name":"Django","icon":"/icons/TechStack/django-logo.png"},{"name":"Postgres","icon":"/icons/TechStack/postgres-logo.png"},{"name":"React JS","icon":"/icons/TechStack/react.svg"},{"name":"Next JS","icon":"/icons/TechStack/nextjs-13.svg"},{"name":"Docker","icon":"/icons/TechStack/docker-logo.png"}]}},{"slug":"bilal-irfan","frontmatter":{"id":1,"title":"Software Engineer","name":"Bilal Irfan","image":"/images/employees/Bilal Irfan.jpg","imageB":"/images/employees/Bilal-Irfan-GreenB.svg","category":["Machine Learning"],"description":"The Smile that makes you forget work stress! An adept Python developer with extensive knowledge of Django framework & NLP algorithms, while having a strong appetite for outdoor games!","moreInfoOne":"Bilal's latest work includes working on a product that ranks entities from the Internet. Using Python Django, NLP, Postgresql, Docker, and GitHub, Bilal was able to Integrate and develop REST APIs, implemented ranking algorithms, wrote CronJobs, and integrated Hugging Face Transformer models for NLP.","moreInfoTwo":"Further, he has worked on a product that detects diseases using Machine Learning Algorithms. Using Django, image processing, Postgresql, and GitHub; he worked on designing and writing database queries along with training the prediction model for accurate detection. He has also worked on a CMS system, creating custom modules for the admin panel, and a summary evaluation feature for the employee using Python Django.","developmentStack":[{"name":"Python","icon":"/icons/TechStack/python.svg"},{"name":"Django","icon":"/icons/TechStack/django-logo.png"},{"name":"NLP","icon":"/icons/TechStack/nlp-logo.png"},{"name":"OpenAI Integration","icon":"/icons/TechStack/open-ai-logo.png"},{"name":"Docker","icon":"/icons/TechStack/docker-logo.png"},{"name":"ML Algo","icon":"/icons/TechStack/machine-learning.png"},{"name":"Image Processing","icon":"/icons/TechStack/image-processing.png"}]}},{"slug":"muhammad-abdullah","frontmatter":{"id":7,"title":"Machine Learning Engineer","name":"Muhammad Abdullah","image":"/images/employees/Muhammad Abdullah.jpeg","imageB":"/images/employees/Muhammad-Abdullah-GreenB.svg","category":["Web App Development","Scraping"],"description":"Abdullah, an avid cricket enthusiast, finds joy in playing the sport and unwinding with anime in his free time. Fueled by a passion for problem-solving, Abdullah aspires to become a data scientist. With each passing day, he steadily approaches his goal, eager to leverage data science to address real-life business challenges.","moreInfoOne":"In Abdullah's recent initiative, the key objective was to revolutionize the role of Business Analysts by automating the process of writing project proposals through the integration of machine learning technologies. This endeavor specifically targeted Business Analysts who encounter challenges in identifying relevant projects from budget files and crafting persuasive proposals. Abdullah's integral role involved utilizing Selenium to scrape all budget files for projects. Leveraging advanced machine learning tools such as GPT-4 and sentence transformers embeddings, he proficiently identified pertinent projects from the budget files, enhancing the efficiency of project selection.","moreInfoTwo":"Additionally, Abdullah's responsibilities extended to scraping business cases of the projects and extracting relevant information from Google using AI. By combining these diverse pieces of information, he orchestrated a comprehensive approach to crafting robust proposals for government projects. The technological toolkit employed for this initiative included Redis, Langchain, Docker, and FastApi, ensuring a seamless and efficient automation process for Business Analysts, ultimately improving their ability to secure government project opportunities.","developmentStack":[{"name":"Python","icon":"/icons/TechStack/python.svg"},{"name":"Django","icon":"/icons/TechStack/django-logo.png"},{"name":"NLP","icon":"/icons/TechStack/nlp-logo.png"},{"name":"OpenAI","icon":"/icons/TechStack/open-ai-logo.png"},{"name":"Redis","icon":"/icons/TechStack/redis-logo-full-color-rgb.svg"},{"name":"Postgres","icon":"/icons/TechStack/postgres-logo.png"},{"name":"Selenium","icon":"/icons/TechStack/selenium-logo.svg"},{"name":"langchain","icon":"/icons/TechStack/langchain.logo.svg"},{"name":"FastApi","icon":"/icons/TechStack/fastapi-logo.svg"}]}},{"slug":"muhammad-nabeel","frontmatter":{"id":3,"title":"Team Lead for ScoopRank","name":"Muhammad Nabeel","image":"/images/employees/Nabeel.jpg","imageB":"/images/employees/Nabeel-GreenB.svg","category":["Web App Development"],"description":"A Full Stack Software Engineer whom you can always challenge for a game of tennis! Nabeel is the person who is always available to help everyone around, comforting, and always accommodating. He also loves reading books, and that is why you will love him around!","moreInfoOne":"Nabeel played a vital role as a Full Stack Developer in the creation of a cutting-edge product focused on ranking entities across the internet. Nabeel's expertise in various technologies was integral to the project's success. The backend of the application was built using Django, a powerful Python-based web framework, while Node.js was leveraged for server-side development. The front end was developed using React.js, a JavaScript library renowned for its flexibility and efficiency. Machine learning algorithms were employed to analyze and rank online entities based on parameters such as popularity, relevance, and user engagement. The data was efficiently stored and managed using Postgres, an open-source relational database management system, while Redis, an in-memory data structure store, served as a versatile tool for caching, database functionality, and message brokering. Docker was utilized to containerize the application, ensuring seamless deployment across diverse environments.","moreInfoTwo":"Further, Nabeel conducted in-depth research and successfully published a research paper on the Comparative Study of Deep Learning Algorithms for Disease and Pest Detection in Rice Crops. Moreover, Nabeel developed a Pakistani Sign Language recognition system, a significant achievement that demonstrates Nabeel's commitment to accessibility and inclusivity in technology.","developmentStack":[{"name":"React","icon":"/icons/TechStack/react.svg"},{"name":"Django","icon":"/icons/TechStack/django-logo.png"},{"name":"Node JS","icon":"/icons/TechStack/node.png"}]}},{"slug":"shahzaib-naseer","frontmatter":{"id":9,"title":"Software Engineer","name":"Shahzaib Naseer","image":"/images/employees/Shahzaib Naseer.jpg","imageB":"/images/employees/Shahzaib-Naseer-GreenB.svg","category":["Mobile App Development","Web App Development"],"description":"Shahzaib, an avid ping pong enthusiast, is celebrated for successfully navigating a complex work project, displaying exceptional collaboration, problem-solving, and leadership skills. His commitment to ongoing learning aligns with aspirations of enhancing expertise and taking on greater responsibilities for organizational growth. Shahzaib strives to make a significant impact on his industry, fostering positive changes in every project.","moreInfoOne":"In Shahzaib's recent engagement, he played a pivotal role in the development and integration of a product designed to assist writers, including students, teachers, bloggers, and journalists. The primary objective was to facilitate code writing in a style that remains undetected by AI Detection apps like GPTZero. Shahzaib's responsibilities included the integration and development of REST APIs, ensuring seamless communication between different components of the system. He played a key role in integrating AI functionalities for smooth code rewriting, enhancing the overall user experience.","moreInfoTwo":"Additionally, Shahzaib took charge of designing and developing the user interface, ensuring an intuitive and user-friendly environment. His technical expertise extended to writing CronJobs, and optimizing system processes for efficiency. Furthermore, Shahzaib facilitated the integration of WordPress CMS for blogs, allowing users to seamlessly incorporate their writing into blogs. The technologies utilized in this project comprised NEXT JS and NODE for the frontend and backend, MongoDB for data management, Docker for containerization, and GitHub for version control.","developmentStack":[{"name":"Node JS","icon":"/icons/TechStack/node.png"},{"name":"Next JS","icon":"/icons/TechStack/nextjs-13.svg"},{"name":"Docker","icon":"/icons/TechStack/docker-logo.png"},{"name":"Django","icon":"/icons/TechStack/django-logo.png"},{"name":"Postgres","icon":"/icons/TechStack/postgres-logo.png"},{"name":"Next JS","icon":"/icons/TechStack/nextjs-13.svg"},{"name":"NLP","icon":"/icons/TechStack/nlp-logo.png"},{"name":"MongoDB","icon":"/icons/TechStack/mongodb-logo.png"}]}},{"slug":"shameen-jamil","frontmatter":{"id":6,"title":"Front-End Developer","name":"Shameen Jamil","image":"/images/employees/Shameen Jamil.jpeg","imageB":"/images/employees/Shameen-Jamil-GreenB.svg","category":["Web App Development"],"description":"Meet Shameen, our health enthusiast who finds joy in watching cinematic YouTube videos and embracing the tranquility of outdoor walks. For her, the journey towards fitness, stability, and a sound sleeping schedule is not just a goal but a way of life. Join Shameen as she navigates a path towards a healthier, more balanced lifestyle.","moreInfoOne":"In Shameen's recent project, she took the lead in developing a state-of-the-art system designed to efficiently oversee medical imaging devices, including X-ray, MRI, and CT, across diverse laboratories. The system excels in promptly dispatching on-site support for issue resolution, catering to the distinctive needs of healthcare facilities. In her pivotal role, Shameen demonstrated her proficiency by designing and implementing intuitive, user-friendly interfaces for the software. She showcased her skills in developing a responsive frontend capable of accommodating various screen sizes and devices seamlessly.","moreInfoTwo":"Furthermore, Shameen excelled in implementing robust data retrieval and display functionalities using APIs, ensuring real-time updates on equipment status and service requests. The technologies employed in this project include React.js, Django, TypeScript, Redux, Material-UI, PostgreSQL, Docker, and engineX, making it an ideal solution for organizations seeking advanced medical machine management.","developmentStack":[{"name":"HTML","icon":"/icons/TechStack/html5.png"},{"name":"CSS","icon":"/icons/TechStack/css3.png"},{"name":"Bootstrap","icon":"/icons/TechStack/bootstrap-logo.png"},{"name":"Javascript","icon":"/icons/TechStack/javascript.svg"},{"name":"React JS","icon":"/icons/TechStack/react.svg"},{"name":"Next JS","icon":"/icons/TechStack/nextjs-13.svg"}]}},{"slug":"tanzeel-khan","frontmatter":{"id":2,"title":"Software Engineer","name":"Tanzeel Ali Khan","image":"/images/employees/Tanzeel-Khan.jpg","imageB":"/images/employees/Tanzeel-Khan-GreenB.svg","category":["Machine Learning","Web App Development"],"description":"Unbeatable when it comes to E-gaming and unmatched in developing robust software systems. Tanzeel loves traveling whenever he finds the time and his favorite hobby is capturing scenic beauty! Or you can always find him engaged in FIFA matches.","moreInfoOne":"Tanzeel’s latest work includes working on an application that automates dropshipping processes. Using Python, Django, Postgresql, RESTAPIs, Webhooks, and Docker, he integrated Rest APIs, developed Chrome extensions, developed data models, and Implemented services to keep synchronization between Chrome extensions and web dashboards.","moreInfoTwo":"Further Tanzeel has worked on an application that allows access to medical devices used in hospitals virtually to monitor them and check for any bugs. He developed a ChatBot using OpenAI GPT-3. Moreover, he worked on authentication and authorization of the system while creating custom modules for the user and admin panel. He used Python, Django, DjangoREST, Postgresql, RESTAPIs, OpenAI GPT-3, and Docker to achieve all this.  Another interesting addition to his work is a web portal that monitors stock behavior and provides multidimensional insights into crypto and the stock market.","developmentStack":[{"name":"Angular","icon":"/icons/TechStack/angular.svg"},{"name":"Django","icon":"/icons/TechStack/django-logo.png"},{"name":"Javascript","icon":"/icons/TechStack/javascript.svg"},{"name":"Postgres","icon":"/icons/TechStack/postgres-logo.png"},{"name":"HTML 5","icon":"/icons/TechStack/html5.png"},{"name":"CSS 3","icon":"/icons/TechStack/css3.png"},{"name":"Bootstrap","icon":"/icons/TechStack/bootstrap-logo.png"},{"name":"AWS","icon":"/icons/TechStack/aws-logo.png"},{"name":"Github","icon":"/icons/TechStack/github-logo.png"}]}},{"slug":"uzair-jameel","frontmatter":{"id":4,"title":"Front-End Software Engineer","name":"Uzair Jameel","image":"/images/employees/Uzair Jamil.png","imageB":"/images/employees/Uzair-Jameel-GreenB.svg","category":["Mobile App Development","Web App Development"],"description":"Uzair Jameel's fervor for gaming is a driving force that harmoniously blends with his talent for crafting distinctive user interfaces (UIs). This fusion of interests results in UIs that are not only visually captivating but also intuitively engaging. Uzair's unique approach leverages his passion for gaming to inspire innovative design concepts that resonate with both gamers and general users. This dedication is evident in the meticulous attention he pays to UI details, consistently delivering captivating and immersive experiences across diverse digital platforms.","moreInfoOne":"Uzair Jameel has left a significant mark with the Mobile App, a standout project where his expertise truly shines. As a Mobile Application Developer, he skillfully crafted a cross-platform app for iOS and Android. This app revolutionizes healthcare by enabling doctors to seamlessly refer patients to fellow healthcare professionals. Leveraging React Native, Expo, and Firebase, Uzair facilitated efficient patient care through advanced technology. Moreover, his Front-End prowess drove the development of a security system, using React JS to provide real-time surveillance against potential threats. He also exhibited his proficiency through the web application that aids field service engineers in troubleshooting tasks using React JS.","moreInfoTwo":"Additionally, Uzair's expertise extended to the Prixite Portfolio Website, showcasing software development excellence through Next JS. Lastly, his work on the SuperballX platform, powered by React JS, catered to gamers and contest enthusiasts seeking exciting rewards. Uzair's diverse roles and adept use of technologies have made a lasting impact across a range of innovative projects.","developmentStack":[{"name":"HTML","icon":"/icons/TechStack/html5.png"},{"name":"CSS","icon":"/icons/TechStack/css3.png"},{"name":"Javascript","icon":"/icons/TechStack/javascript.svg"},{"name":"React JS","icon":"/icons/TechStack/react.svg"},{"name":"Next JS","icon":"/icons/TechStack/nextjs-13.svg"},{"name":"React Native","icon":"/icons/TechStack/react.svg"},{"name":"Firebase","icon":"/icons/TechStack/firebase.svg"}]}},{"slug":"wasi-haider","frontmatter":{"id":8,"title":"Technical Team Lead","name":"Wasi Haider","image":"/images/employees/Wasi Haider.jpg","imageB":"/images/employees/Wasi-Haider-GreenB.svg","category":["Web App Development"],"description":"Meet Wasi, our coding virtuoso with a passion for singing. His melodies put life into our bonfire during the Hunza Annual Tour. Mastering all types of songs, he amazed us with his soulful voice! Beyond that, he channels his creativity into building test projects, mastering diverse skills along the way. Whether crafting small-scale experiments or diving into larger projects, Wasi's journey in coding is a harmonious blend of technical expertise and musical finesse.","moreInfoOne":"In the realm of Salesforce, Wasi played a vital role in a project aimed at eliminating data duplication and generating reports for millions of records. His responsibilities included integrating web APIs for backend data processing, resolving bugs, and converting the entire product to a Postgres database using SQLAlchemy. Technologies in his toolkit comprised Python, Flask, Postgres, Docker, SqlAlchemy, Salesforce, and Heroku.","moreInfoTwo":"Wasi's adept use of technologies, including Python, Flask, Postgres, Docker, SqlAlchemy, Salesforce, and Heroku, showcased his expertise in creating a streamlined and high-performing solution. His dedication to excellence and innovative problem-solving significantly contributed to the project's success, solidifying his reputation as a key contributor to Salesforce development initiatives.","developmentStack":[{"name":"Python","icon":"/icons/TechStack/python.svg"},{"name":"Django","icon":"/icons/TechStack/django-logo.png"},{"name":"Postgres","icon":"/icons/TechStack/postgres-logo.png"},{"name":"AWS","icon":"/icons/TechStack/aws-logo.png"},{"name":"Docker","icon":"/icons/TechStack/docker-logo.png"}]}}]},"__N_SSG":true}